# TextureRealWorldScaleY Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnifiedBitmap..::..TextureRealWorldScaleY Property
UnifiedBitmap Class See Also
---
The property labeled "Size Y" from the "UnifiedBitmap" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static string TextureRealWorldScaleY { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextureRealWorldScaleY As String
	Get
```

Visual C++
---
```text
public:
static property String^ TextureRealWorldScaleY {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDistance" with a minimum of "0.01".
# See Also
UnifiedBitmap Class
Autodesk.Revit.DB.Visual Namespace